{
  'MATH 2A. Calculus with Algebra and Trigonometry': {
    units: '5',
    prerequisites: [],
    enrollmentComments: 'Students who have completed Math 34A will only receive 3 units for Math 2A.Not open for credit to students who have completed Math 3A or 3AS or have passed the AP Calculus AB or BC exams.',
    description: 'Math 3A with precalculus: A function approach integrating algebra, trigonometry, and differential calculus. Topics include: one-on-one and onto functions; inverse functions; properties and graphs of polynomial, rational, exponential, and logarithmic functions; properties and graphs of trigonometric functions; analytic geometry; functions and limits; derivatives; techniques and applications of differentiation; logarithmic and trigonometric functions.'
  },
  'MATH 2B. Calculus with Algebra and Trigonometry': {
    units: '5',
    prerequisites: ["2A"],
    enrollmentComments: 'Students who have completed Math 34B will only receive 3 units for Math 2B. Not open for credit to students who have completed Math 3B or 3BS or have passed the AP Calculus BC exam.',
    description: 'Math 3B with precalculus: A continued review of relevant topics from precalculus (see Math 2A); integral calculus, including definite and indefinite integrals; techniques of integration, with applications in mathematics and physics.'
  },
  'MATH 3A. Calculus with Applications, First Course': {
    units: '4',
    prerequisites: 'Qualifying score on the Mathematics Placement Exam.',
    recommendedPreparation: 'Students with Advanced Placement Credit should contact the department.',
    enrollmentComments: ["2A", "3AS"],
    description: 'Differential Calculus including analytic geometry, functions and limits, derivatives, techniques and applications of differentiation, logarithmic and trigonometric functions.'
  },
  'MATH 3B. Calculus with Applications, Second Course': {
    units: '4',
    prerequisites: ["3A"],
    recommendedPreparation: 'Students with Advanced Placement Credit should contact the department.',
    enrollmentComments: 'Students who have completed Math 34B will only receive 2 units for Math 3B.Not open for credit to students who have completed Math 2B or 3BS or have passed the AP Calculus BC exam.',
    description: 'Integral calculus including definite and indefinite integrals, techniques of integration, with applications in mathematics and physics.'
  },
  'MATH 4A. Linear Algebra with Applications': {
    units: '4',
    prerequisites: ["2B", "3B", "3BI"],
    description: 'Systems of linear equations, matrix algebra, determinants, vector spaces and subspaces, basis and dimension, linear transformations, eigenvalues and eigenvectors, diagonalization, and orthogonality.'
  },
  'MATH 4AI. Inquiry Based Linear Algebra': {
    units: '4',
    prerequisites: ["3B", "3BI"],
    enrollmentComments: 'Misc: Not open for credit to students who have completed Math 3C or Math 4A.',
    description: 'Honors version of Mathematics 4A. Mathematical inquiry course is developed through problem solving and discovery.'
  },
  'MATH 4B. Differential Equations': {
    units: '4',
    prerequisites: ["4A", "4AI"],
    description: 'First and second order differential equations, separation of variables, linear differential equations, systems of first order equations, nonlinear differential equations and stability.'
  },
  'MATH 4BI. Inquiry Based Differential Equations': {
    units: '4',
    prerequisites: ['3C', '3CI', '4A', '4AI'],
    enrollmentComments: 'Misc: Not open for credit to students who have completed Math 4B or 5A.',
    description: 'Honors version of Mathematics 4B. Mathematical inquiry course is developed through problem solving and discovery.'
  },
  'MATH 6A. Vector Calculus with Applications, First Course': {
    units: '4',
    prerequisites: ['4A', '4AI', '5A', '5AI'],
    description: 'Calculus of functions of several variables, vector-valued functions of one variable, scalar and vector fields, integration along paths, double and triple integrals, integration over surfaces, properties, and applications of integrals, and classical integration theorems of vector calculus.'
  },
  'MATH 6AI. Inquiry Based Calculus IV': {
    units: '4',
    prerequisites: ['4A', '4AI', '5A', '5AI'],
    enrollmentComments: 'Not open for credit to students who have completed Mathematics 5B or Math6A.',
    description: 'Honors version of Mathematics 6A. Mathematical inquiry course is developed through problem solving and discovery.'
  },
  'MATH 6B. Vector calculus with Applications, Second Course': {
    units: '4',
    prerequisites: ['4B', '4BI', '5B', '5BI', '6A', '6AI'],
    description: 'Integral theorems of vector calculus (continuation), infinite series, Fourier series, integrals and transforms, partial differential equations.'
  },
  'MATH 7H. Honors Seminar-Calculus': {
    units: '1',
    prerequisites: ['3A', '3B', '3BI', '3C', '4A', '4AI', '4B', '4BI', '5A', '5AI', '6A', '6AI', '6B'],
    recommendedPreparation: 'epeated for credit to a maximum of 6 units.',
    description: 'Emphasizing fundamental concepts and applications. Intended for highly motivated and well prepared students.'
  },
  'MATH 8. Transition to Higher Mathematics': {
    units: '5',
    prerequisites: ['3C', '3CI', '4A', '4AI', '4B', '4BI', '5A', '5AI', '5B', '5BI', '5C', '6A', '6AI', '6B'],
    description: 'Introduction to the elements of propositional logic, techniques of mathematical proof, and fundamental mathematical structures, including sets, functions, relations, and other topics as time permits. Mastery of this material is essential for students planning to major in mathematics.'
  },
  'MATH 34A. Calculus for Social and Life Sciences': {
    units: '4',
    prerequisites: ['2A', '3A', '3AS'],
    description: 'Introduction to differential and integral calculus with applications to modeling in the biological sciences.'
  },
  'MATH 34B. Calculus for Social and Life Sciences': {
    units: '4',
    prerequisites: ['2A', '3A', '3AS', '34A'],
    enrollmentComments: 'Not open for credit to students who have completed Math 2B or 3B or 3BS, or are simultaneously enrolled in 2B or 3B, or have passed the AP Calculus BC exam.',
    description: 'Continued study of differential and integral calculus with differential andintegral calculus with applications. Introduction to mathematical modeling with differential equations. Calculus of several variables including an introduction to partial derivatives.'
  },
  'MATH 94. Group Studies in Mathematics': {
    units: '1',
    prerequisites: ['3C', '3CI', '4A', '4AI', '4B', '4BI', '5A', '5AI', '5B', '5BI', '5C', '6A', '6AI', '6B'],
    enrollmentComments: 'Requires concurrent enrollment in MATH 190',
    description: 'Lectures and discussions on special topics. Designed for transfer students only.'
  },
  'MATH 100A. Mathematics for Elementary Teaching, I': {
    units: '3',
    prerequisites: [],
    enrollmentComments: 'Course cannot be used to satisfy any mathematics major or minor requirements.',
    description: 'This class teaches ways to think about and explain elementary school mathematics. Topics include: cultural and base-n number systems, algorithms, elementary number theory, probability, and graphing.'
  },
  'MATH 100B. Mathematics for Elementary Teaching, II': {
    units: '3',
    prerequisites: ["100A"],
    enrollmentComments: 'Course cannot be used to satisfy any mathematics major or minor requirements.',
    description: 'Completes the explanation of elementary school mathematics by discussing geometry and algebra. Discusses the pedagogy with the California mathematics framework, the NCTM standards, and "replacement units".'
  },
  'MATH 101A. Classical Number Systems': {
    units: '4',
    prerequisites: ["3A"],
    enrollmentComments: 'Not open for credit to students who have completed Mathematics 118A.',
    description: 'A conceptual rather than an axiomatic development starting with the natural numbers and progressing through the integral, rational, real, and complex number systems. The historical implications of these developments in number systems. Especially suitable for prospective middle and high school teachers.'
  },
  'MATH 101B. Mathematical Systems': {
    units: '4',
    prerequisites: ["101A"],
    enrollmentComments: 'Not open for credit to students who have completed Mathematics 118A.',
    description: 'The theory of operations within rings and fields and the foundations of the real number system. Ideals, quotient rings, and factorization theorems. The history and the historical implications of these developments in mathematical systems. Especially suitable for prospective middle and high school teachers.'
  },
  'MATH 102A. Modern Euclidean and Noneuclidean Geometry': {
    units: '4',
    prerequisites: ["3B", "8"],
    description: 'Topics in plane and solid geometry. The axioms of pure, euclidean, projective, and noneuclidean geometry. Transformational geometry (isometries, dilitations, involutions, perspectivities, and projectivities). The history and the historical implications of these developments in geometry. Especially suitable for prospective middle and high school teachers.'
  },
  'MATH 102B. Modern Euclidean and Noneuclidean Geometry': {
    units: '4',
    prerequisites: ["102A"],
    description: 'Topics in plane and solid geometry. The axioms of pure, euclidean, projective, and noneuclidean geometry. Transformational geometry (isometries, dilitations, involutions, perspectivities, and projectivities). The history and the historical implications of these developments in geometry. Especially suitable for prospective middle and high school teachers.'
  },
  'MATH 103. Introduction to Group Theory': {
    units: '4',
    prerequisites: ["8"],
    enrollmentComments: 'Not open for credit to students who have completed Mathematics 111A.',
    description: 'Permutation groups, cyclic groups, theory of finite groups, group homomorphisms and isomorphisms, and Abelian groups. Applications to number theory and geometry.'
  },
  'MATH 108A. Introduction to Linear Algebra': {
    units: '4',
    prerequisites: ['3C', '3CI', '4A', '4AI,', '4B', '4BI', '5A', '5AI', '8'],
    description: 'Abstract vector spaces subspaces. Span and linear independence. Basis and dimension. Linear maps. Eigenvalues and eigenvectors.'
  },
  'MATH 108B. Introduction to Linear Algebra': {
    units: '4',
    prerequisites: ['108A'],
    description: 'Diagonalization, inner product spaces, projections, least- squares approximations, invariant factors and elementary divisors, canonical forms, topics from advanced matrix theory, applied linear algebra, and group representation theory.'
  }
}
